init 5 python:
    addEvent(
        Event(
            persistent._mas_fun_facts_database,
            eventlabel="mas_fun_fact_pinknt",
        ),
        code="FFF"
    )

label mas_fun_fact_pinknt:
    m 3eua "Знаешь ли ты, что розового цвета на самом деле не существует?"
    m 1eub "А также любой другой цвет, который является смесью синего и красного, например, фиолетовый, пурпурный, индиго, и так далее."
    m 1eua "Это займет некоторое время, чтобы объяснить, так что наберись терпения, ладно?"
    m 1eub "Итак, сначала я должна объяснить, что на самом деле представляют собой цвета радуги."
    m 1eua "Когда ты думаешь о цветах радуги, ты вспоминаешь аббревиатуру «КОЖЗСГФ», да?"
    m 1eub "«КОЖЗСГФ» значат Красный, Оранджевый, Желтый, Зеленый, Синий, Голубой, Фиолетовый."
    m 1eua "Когда ты слышишь слово \"violet\", ты представляешь себе фиолетовый?"
    m 1eub "Ну, фиолетовый - это не то. Ты думаешь о совершенно другом цвете!"
    m 1eua "Возможно, ты {M=слышал}{F=слышала} о строчке, используемой для начала некоторых простых стихотворений: \"Розы - красные, фиалки - синие\", да?"
    m 1eub "Фиалка - это настоящий цветок в реальной жизни, и есть такие, чьи лепестки темно-синие, или просто синие."
    m 1eua "Тогда это будет «КОЖЗСГФ»."
    m 1eub "Итак, первый \"Синий\" в аббревиатуре - это циановый."
    m 1eua "Если ты знаком с шестнадцатеричными цветовыми кодами, ты мог заметить, что сочетание синего и зеленого создает голубой цвет."
    m 1eub "Тогда получается аббревиатура «КОЖЗСГФ»."
    m 1eua "И, наконец, \"Индиго\". Его вообще не должно быть в радуге."
    m 1eub "Индиго - это комбинация синего и фиолетового, что в свою очередь делает его комбинацией синего и красного, причем синего больше, чем красного."
    m 1eua "Причина, по которой индиго вообще находится в радуге, заключается в том, что человек, создавший аббревиатуру, включил индиго, чтобы она соответствовала 7 нотам:"
    m 1eub "До, Ре, Ми, Фа, Соль, Ля, Си."
    m 1eua "Таким образом, цвета радуги - это красный, оранжевый, желтый, зеленый, голубой, синий, или «КОЖЗСГФ»."
    m 1eub "А теперь о другом: предполагается, что розовый является смесью красного и синего света, но на самом деле ты не можешь их смешать, поскольку они находятся на противоположных сторонах спектра."
    m 1eua "Поэтому не существует розовых фотонов или розового света в целом."
    m 1eub "Единственная причина, по которой мы можем видеть эти цвета, заключается в том, что на самом деле мы видим красные и синие фотоны, но они находятся так близко друг к другу, что наш мозг смешивает их."
    m 1eua "То же самое касается и других цветов, таких как фиолетовый, пурпурный и индиго."

    call mas_fun_facts_end from _call_mas_fun_facts_end_30
    return

init 5 python:
    addEvent(
        Event(
            persistent._mas_fun_facts_database,
            eventlabel="mas_fun_fact_yocto",
        ),
        code="FFF"
    )

label mas_fun_fact_yocto:
    m 3eua "Знаешь ли ты, что наименьшей единицей измерения в метрической системе является йоктометр?"
    m 1wuo "Один йоктометр в 1 септиллион раз меньше метра! Это очень мало!"
    m 1wud "Нет, нет, очень мало - это недостаточно. Я даже не могу описать это как микроскопическое, настолько оно маленькое."
    m 1eub "Нет ничего, что действительно можно было бы измерить в йоктометрах, за исключением некоторых теоретических частиц."
    m 1eua "Но... йоктометр - это не самая маленькая единица измерения из существующих."
    m 1eub "Эта честь досталась длине Планка."
    m 1eua "А планковская длина составляет..."
    m 1wuo "В 62,5 миллиарда раз меньше йоктометра!"
    m 1wuo "Как им вообще удалось измерить что-то настолько неописуемо маленькое!?"
    m 1wud "В любом случае..."

    call mas_fun_facts_end from _call_mas_fun_facts_end_31
    return

init 5 python:
    addEvent(
        Event(
            persistent._mas_fun_facts_database,
            eventlabel="mas_fun_fact_whaleskeleton",
        ),
        code="FFF"
    )

label mas_fun_fact_whaleskeleton:
    m 3eua "Если ты будешь искать скелет кита в Гугле, ты можешь заметить, что на некоторых изображениях есть крошечный кусочек кости рядом с тем местом, где у кита была бы нижняя часть тела."
    m 1eub "Этот крошечный кусочек на самом деле является последними остатками того, что когда-то было ногами и тазом кита, когда он эволюционировал из наземных млекопитающих миллионы лет назад."
    m 1hua "Забавно, что даже несмотря на то, что они полностью потеряли ноги и таз, они всё равно сохранили эту вещь, чтобы помнить своих предков."
    m 1esc "Хотя, зная, как работает эволюция, это явно было непреднамеренно."
    m 1etc "Что заставляет меня задуматься, не исчезнет ли и этот маленький кусочек кости в ближайшие несколько миллионов лет?"
    m 1eub "Это действительно заставляет задуматься."

    call mas_fun_facts_end from _call_mas_fun_facts_end_32
    return

init 5 python:
    addEvent(
        Event(
            persistent._mas_fun_facts_database,
            eventlabel="mas_fun_fact_thisisafunfact",
        ),
        code="FFF"
    )

label mas_fun_fact_thisisafunfact:
    m 3eua "Этот факт очень веселый!"
    m 1esc "Не переживай, я могу найти новые интересные факты."
    m 1eub "Но я должна была дать тебе хоть что-то, по крайней мере!"

    call mas_fun_facts_end from _call_mas_fun_facts_end_33
    return